docs: switch workflow diagram to ascii
